---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewInnerShellMode
source: html/9d7d97c7-1a14-1ab7-14a2-9e4e121ae2c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewInnerShellMode Property

"Show Inner Space Shells"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewInnerShellMode { get; }
```